app/controllers/db_connects_controller.rb

SELECT "db_connects".* FROM "db_connects"
---
  def index
    @db_connects = DbConnect.all

INSERT INTO "db_connects" ("data_base", "username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["data_base", "qw"], ["username", "qw"], ["password", ""], ["created_at", "2015-12-01 09:33:33.348890"], ["updated_at", "2015-12-01 09:33:33.348890"]]
---
  def create
    @db_connect = DbConnect.new(db_connect_params)

    respond_to do |format|
      if @db_connect.save

UPDATE "db_connects" SET "data_base" = $1, "username" = $2, "password" = $3, "updated_at" = $4 WHERE "db_connects"."id" = $5  [["data_base", "Depot_development"], ["username", "postgres"], ["password", "130994"], ["updated_at", "2015-12-02 08:47:03.663329"], ["id", 3]]
---
  def update

    respond_to do |format|
      if @db_connect.update(db_connect_params)

DELETE FROM "db_connects" WHERE "db_connects"."id" = $1  [["id", 2]]
---
  def destroy
    @db_connect.destroy

SELECT  "db_connects".* FROM "db_connects" WHERE "db_connects"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_db_connect
      @db_connect = DbConnect.find(params[:id])