app/controllers/schemas_controller.rb

SELECT "schemas".* FROM "schemas"
---
  def show
    collection
      respond_to do |format|
      format.html { }
      format.csv { render text: Schema.to_csv(@columns_names, @model.all) }